//=============================================================================
// タイトルのエンター処理 [control_ui_title_push.cpp]
// Author : 小笠原 彪我
//=============================================================================
//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "control_ui_title_push.h"
#include "ui.h"
#include "title.h"
//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CControlPushUI::CControlPushUI()
{
	// メンバー変数のクリア
	m_col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	m_bAlphaChange = true;
}

//=============================================================================
// デストラクタ
//=============================================================================
CControlPushUI::~CControlPushUI()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlPushUI::Init(void)
{
	// 変数の初期化
	m_col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	m_bAlphaChange = true;	// 透明度を変化させる
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlPushUI::Uninit(void)
{
}
//=============================================================================
// 更新処理
//=============================================================================
void CControlPushUI::Update(CScene * pScene)
{
	// 引数のポインタをUIクラスにキャストする
	CUi *pUI = NULL;
	pUI = (CUi*)pScene;

	// ボタン押下で
	if (m_bAlphaChange == false)
	{
		m_col.a += ALPHA_CHANGE;
		if (m_col.a >= 1.0f)
		{
			m_col.a = 1.0f;
			m_bAlphaChange = true;
		}
	}
	else
	{
		m_col.a -= ALPHA_CHANGE;
		if (m_col.a <= 0.0f)
		{
			m_col.a = 0.0f;
			m_bAlphaChange = false;
		}
	}

	if (CTitle::GetPush() == true)
	{
		m_col.a = 0.0f;
	}
	// 透明度を設定
	pUI->SetColor(m_col);
}
//=============================================================================
// 生成処理
//=============================================================================
CControlPushUI *CControlPushUI::Create(void)
{
	// インスタンスの生成
	CControlPushUI *pControlPushUI = NULL;

	// ヌルチェック
	if (pControlPushUI == NULL)
	{
		// クラスの生成
		pControlPushUI = new CControlPushUI;
		if (pControlPushUI != NULL)
		{
			// 初期化処理
			pControlPushUI->Init();
		}
	}

	return pControlPushUI;
}
