//=============================================================================
// タイトルのエンター処理 [control_ui_title_push.h]
// Author : 小笠原 彪我
//=============================================================================
#ifndef _CONTROL_UI_TITLE_PUSH_H_
#define _CONTROL_UI_TITLE_PUSH_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ALPHA_CHANGE 0.006f	// 透明度の変化量

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CControlPushUI : public CControl
{
public:
	CControlPushUI();						// コンストラクタ
	~CControlPushUI();						// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(CScene *pScene);			// 更新処理
	static CControlPushUI *Create(void);	// 生成処理

private:
	D3DXCOLOR	m_col;		// カラー
	int			m_nColCnt;	// カウンター
	bool		m_bAlphaChange;	// 透明度の変化
};

#endif	//_CONTROL_PLAYER_H_